'''
테트로미노가 놓인 칸에 쓰여 있는 수들의 합을 최대로

테트로미노 모양을 좌표화
'''
# (0,0)을 포함하면서 아래의 block을 포함하는
blocks = (
    # 일자 막대
    ((0,1), (0,2), (0,3)),
    ((1,0), (2,0), (3,0)),
    #ㄱ자 막대
    ((1,0), (1,1), (1,2)),
    ((0,1), (1,0), (2,0)),
    ((0,1), (0,2), (1,2)),
    ((1,0), (2,0), (2,-1)),
    ((0,1), (0,2), (-1,2)),
    ((1,0), (2,0), (2,1)),
    ((0,1), (0,2), (1,0)),
    ((0,1), (1,1), (2,1)),
    # 정사각형
    ((0,1), (1,0), (1,1)),
    # ㄹ자 막대
    ((0,1), (-1,1), (-1,2)),
    ((1,0), (1,1), (2,1)),
    ((0,1), (1,1), (1,2)),
    ((1,0), (1,-1), (2,-1)),
    # ㅓ모양 막대
    ((0,1), (0,2), (-1,1)),
    ((0,1), (0,2), (1,1)),
    ((1,0), (2,0), (1,1)),
    ((1,0), (2,0), (1,-1)),
)
# 세로 n 가로 m
n,m = map(int,input().split())
a = [list(map(int,input().split())) for _ in range(n)]
ans = 0
for i in range(n):
    for j in range(m):
        for block in blocks:
            ok = True
            s = a[i][j]
            for dx, dy in block:
                x, y = i + dx, j + dy
                if 0 <= x < n and 0 <= y < m:
                    s += a[x][y]
                else:
                    ok = False
                    break
            if ok and ans < s:
                ans = s
print(ans)